app/views/order_notifier/shipped.html.erb

SELECT "product_items".* FROM "product_items" WHERE "product_items"."order_id" = ?  [["order_id", 6]]
---

<% @order.product_items.each do |item| %>