app/views/pages/shop.html.erb

SELECT "products".* FROM "products"
---
	<div class="container">
		<!--cache ['Store', Product.latest] do -->