app/controllers/orders_controller.rb

	def new
		if @cart.product_items.empty?
---
SELECT  1 AS one FROM "product_items" WHERE "product_items"."cart_id" = ? LIMIT ?  [["cart_id", 5], ["LIMIT", 1]]
SELECT "product_items".* FROM "product_items" WHERE "product_items"."cart_id" = ?  [["cart_id", 5]]

	def create
		@order = Order.new(order_params)
		@order.add_product_items_from_cart(@cart)
		if @order.save
			Cart.destroy(session[:cart_id]) #no longer need cart with these products if order placed
---
INSERT INTO "orders" ("name", "email", "address", "city", "country", "created_at", "updated_at", "state") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 5]]