app/controllers/pages_controller.rb

SELECT "products".* FROM "products"
---
  def shop
    @products = Product.all