app/controllers/product_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? ORDER BY "products"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "product_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["cart_id", 2], ["created_at", "2018-03-12 14:59:01.838510"], ["updated_at", "2018-03-12 14:59:01.838510"]]
UPDATE "product_items" SET "quantity" = ?, "updated_at" = ? WHERE "product_items"."id" = ?  [["quantity", 2], ["updated_at", "2018-03-12 14:59:23.534729"], ["id", 1]]
---
	def create
		product = Product.find(params[:product_id])
		@product_item = @cart.add_product(product.id)
		if @product_item.save